com-th-soap-ws-demo-1/z_client_xml/addEmployeeRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
				  xmlns:gs="https://www.torryharris.com/soap-ws-demo">
   <soapenv:Header/>

   <soapenv:Body>
         <gs:addEmployeeRequest>
         <gs:employeeId>112</gs:employeeId>
         <gs:firstName>Yet Some Name</gs:firstName>
         <gs:salary>45000</gs:salary>
	 </gs:addEmployeeRequest>
   </soapenv:Body>
   
</soapenv:Envelope>
